---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSettings
source: html/1b45583b-c371-3160-f3be-01f1eb1fa1b3.htm
---
# StructuralSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.